ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32_WordClockV223/ESP32_WordClockV223.ino
class MyCallbacks: public NimBLECharacteristicCallbacks 
{
 void onWrite(NimBLECharacteristic *pCharacteristic, NimBLEConnInfo& connInfo) override  
  {
   std::string rxValue = pCharacteristic->getValue();
   ReceivedMessageBLE = rxValue + "\n";
  }  
};

//--------------------------------------------                                                //
// BLE Start BLE Service
//--------------------------------------------
void StartBLEService(void)
{
 NimBLEDevice::init(Mem.BLEbroadcastName);
 pServer = NimBLEDevice::createServer();
 pServer->setCallbacks(new MyServerCallbacks());
 BLEService *pService = pServer->createService(SERVICE_UUID);
 pTxCharacteristic = pService->createCharacteristic(
        CHARACTERISTIC_UUID_TX, NIMBLE_PROPERTY::NOTIFY);
 BLECharacteristic *pRxCharacteristic = pService->createCharacteristic(
        CHARACTERISTIC_UUID_RX, NIMBLE_PROPERTY::WRITE);
 pRxCharacteristic->setCallbacks(new MyCallbacks());
 NimBLEAdvertising *pAdvertising = NimBLEDevice::getAdvertising();                            // Configure advertising AFTER server start
 pAdvertising->addServiceUUID(SERVICE_UUID);
 NimBLEAdvertisementData scanResponse;                                                         // Scan response needed for Android (Samsung) to find device in BLE scan
 scanResponse.setName(Mem.BLEbroadcastName);
 pAdvertising->setScanResponseData(scanResponse);
 pAdvertising->start();
 TekstSprint("BLE Waiting a client connection to notify ...\n");
}

//--------------------------------------------                                                //
// BLE Disconnect BLE Service
// NimBLE's built-in disconnect (higher level)
//--------------------------------------------
void DisconnectBLE(void)
{
 auto* server = NimBLEDevice::getServer();
 if (server)
   {
    auto connHandles = server->getPeerDevices();                                              // Get actual connection handles (not index)
    if (!connHandles.empty())
      {
       pServer->disconnect(connHandles[0]);
      }
    BLEConnectedSince = 0;
   }
}
//--------------------------------------------                                                //
// BLE CheckBLE input and rework string
// After 1/4 hour the BLE connection is disconnected
//--------------------------------------------
void CheckBLE(void)
{
 if (BLEConnected && !oldBLEConnected) 
   {
    oldBLEConnected = BLEConnected;
    BLEConnectedSince = millis();                                                             // Mark time of last connection 1/4 hour after this time the BLE connection will disconnect
   }
 if (!BLEConnected && oldBLEConnected)                                                        // If device is disconnected start advertising
   {
    delay(300);
    pServer->startAdvertising();
    TekstSprint("Start advertising\n");
    oldBLEConnected = BLEConnected;
    BLEConnectedSince = 0;                                                                    // Reset BLE connection timer
   }
 if ((BLEConnected && BLEConnectedSince > 0) && (millis() - BLEConnectedSince > 900000))      // Disconnect if connected longer than 15 minutes inactivity 
   {
    auto connHandles = NimBLEDevice::getServer()->getPeerDevices();                           // Vector of uint16_t handles
    if (!connHandles.empty()) 
      {
       pServer->disconnect(connHandles[0]);
       TekstSprint("Disconnected BLE client after 1/4 hour\n");
       BLEConnectedSince = 0;
      }
    }
 if(ReceivedMessageBLE.length()>0)
   {
    SendMessageBLE(ReceivedMessageBLE);
    String BLEtext = ReceivedMessageBLE.c_str();
    ReceivedMessageBLE = "";
    ReworkInputString(BLEtext); 
    BLEConnectedSince = millis();                                                             // Mark time of last connection 1/4 hour after this time the BLE connection will disconnect
   }
}

// ============================================================================
// TimeReceiver.h  -  BLE TimeReceiver client (NimBLE-Arduino v2.x)
//
// Reworked so that:
//   * BLE callbacks ONLY set flags (no allocation, no deleteClient, no rescan)
//   * Every deleteClient / scan->stop / rescan runs in loop() context, driven
//     by CheckTimeReceiverClient()
//   * Both callback objects are single STATIC instances passed with `false`
//     (NimBLE never frees them) -> no per-attempt callback-object leak
//
// Connects to a TimeSender peripheral advertising TIMESENDER_DEVICE_NAME.
//
// Requires (already declared in the main sketch):
//   TIMESENDER_DEVICE_NAME, TIMERECEIVER_MIN_RSSI, SERVICE_UUID,
//   CHARACTERISTIC_UUID_TX, CHARACTERISTIC_UUID_RX, CONNECT_TIMEOUT_MS,
//   pClient, pRemoteTX, pRemoteRX, TRfoundAddr, TRhaveFoundAddr,
//   TRconnectRequested, TRConnecting, TRConnected, TRconnectStartms,
//   LastTimeReceiverScan, TimeReceiverRunning, TRConnectedSince,
//   Tekstprintln(), Tekstprintlnf(), ReworkInputString()
// ============================================================================

// ----------------------------------------------------------------------------
// One extra flag (add this with the other TR statics in the main sketch, OR
// leave it here if this header is included after those declarations).
// ----------------------------------------------------------------------------
// static volatile bool TRneedsCleanup = false;                                    // Set by onDisconnect, handled in loop()

// // Forward declarations (definitions are further down in the sketch)
// static void Connect_TimeReceiver(void);
// void StartTimeReceiverScan(void);

//--------------------------------------------                                  //
// BLE TimeReceiver RX notify callback
// Runs in the NimBLE host task. Keep it short. ReworkInputString() is heavy
// but is the existing behaviour; it is not BLE-cleanup, so it stays.
//--------------------------------------------
static void TimeReceiverNotifyCB(NimBLERemoteCharacteristic*, uint8_t* data, size_t len, bool notify)
{
 static char buf[128];
 size_t n = (len < sizeof(buf) - 1) ? len : sizeof(buf) - 1;
 memcpy(buf, data, n);
 buf[n] = 0;
 ReworkInputString(String(buf));
 TRConnectedSince = millis();
}

